{
  "d514810200ab1fba684401fa5d09cc8e": {
    "timestamp": 1768632575.413385,
    "query": "How do I search for hotels?",
    "data": {
      "title": "Static Content Api",
      "url": "https://docs-hotel.prod.zentrumhub.com/docs/static-content-api",
      "content": "Static Content API\nJump to Content\nHome\nGuides\nSamples\nAPI Reference\nDiscussions\nv\n1.0\nLog In\nGuides\nLog In\nv1.0\nHome\nGuides\nSamples\nAPI Reference\nDiscussions\nStatic Content API\nAll\nPages\nStart typing to search…\nDocumentation\nZentrumHub Introduction\nZentrum Booking Engine\nGetting Started\nAutosuggest\nGet Suggestions API\nGet Location Details API\nStatic Content API\nSearch API\nAsynchronous Search API\nBlocking Search API\nRoomRates API\nRecommendation Deduplication in Rooms and Rates Response Model\nDirect RoomsRates API\nPrice API\nBook API\nBooking Details API\nCancellation Penalty API\nCancel API\nZentrum Connect\nGetting Started\nContent API\nGet mapped hotel Ids\nDownload Content\nHotel Rate APIs\nSearch Hotels\nGet Rooms and Rates\nDirect Rooms and Rates\nPrice Rooms and Rates\nBooking API\nBook\nGet Booking Details\nCancel\nPowered by\nStatic Content API\nZentrumHub's Static Content API delivers comprehensive static content details about hotel properties, enabling users to easily access essential information. This API provides data on hotel names, facilities, images, star ratings, review ratings, addresses, and contact information, among other details. Furthermore, it supports advanced geographical search options, including polygon, circular region, and multi-polygon searches, allowing for precise location-based queries. Users can also search using specific hotel IDs, facilitating quick access to detailed information about particular properties. This rich and varied content ensures that users have all the necessary information at their fingertips, making the Static Content API an invaluable resource for applications requiring detailed hotel property data.\nStatic Content API Details:\nHTTP:\nPOST\nEndpoint:\n{baseEndpoint}/api/content/hotelcontent/getHotelContent\nFAQs\nWhat values are supported for the contentFields parameter?\nThe contentFields parameter supports the following values:\nBasic, All, Facilities, MasterFacilities, NearByAttractions, Policies, Images, CheckInCheckout, Descriptions, Neighbourhoods, Fees, Reviews, Rooms\nHotel content request - in the contentFields, are there options in addition to below pasted from the request sample? What does \"basic\" include?\nBelow are the details provided under basic:\nCategory, ChainCode, ChainName, Contact, Distance, GeoCode, HeroImage, Id, Language, Name, ProviderHotelId, ProviderId, ProviderName, RelevanceScore, Website, Type, StarRating, ImageCount, RatePlanTypes, Attributes\nWhat does contentFields=All return?\nThe All value returns all available content for a hotel. It is equivalent to combining all other contentFields values.\nIf you want additional fields with Basic, you can combine them in one request, This will return Basic fields plus Facilities and Images in a single response.\nHotel static content - is there an option to download static content on a regular basis, or does it have to be retrieved via the Get Hotel Content API as part of the booking workflow? There is some basic content that we need locally based on the way our product is architected today, including hotel id, hotel name, hotel address, star rating, latitude/longitude, phone number.\nWe don't have any API on our end to allow downloading static content.\nYou will need to use the getHotelContent API to fetch hotel content details.\nYou will find all the basic details of the hotels in the response.\nDoes the API support the biasing of search results?\nYes, the Content API returns a relevance score for each hotel based on pre-configured biasing rules. These rules can be set up in the hotel's static content fields. The results can be sorted based on the relevance score. The hotels with the highest relevance score can be displayed at the top of the list.\nIf the same hotel is available from multiple suppliers, how can I display the static content for that hotel?\nThe API returns static content from a single supplier. The supplier is decided based on the pre-configured supplier preferencing for static content. Alternatively, you can also provide the supplier preferences in the request in the providerPrefs field.\nError Codes\nError Code\nError Message\n4001\nInvalid data in request - Please refer to the fields[] for more details.\n5000\nYour request failed due to an unknown system error. Please contact support team with the correlationId.\nUpdated\n2 months ago\nWhat’s Next\nPlease visit the following link:\nhttps://zentrumhub-hotel-api.readme.io/reference/post_api-content-hotelcontent-gethotelcontent\nAsk AI",
      "source": "live_docs",
      "score": 105
    }
  }
}